`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2024/11/11 21:06:55
// Design Name: 
// Module Name: alu_tb
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module alu_tb;
reg [31:0] a, b;
reg [3:0] aluc;
wire [31:0] r;
wire zero, carry, negative, overflow;
 
alu uut (
    .a(a),
    .b(b),
    .aluc(aluc),
    .r(r),
    .zero(zero),
    .carry(carry),
    .negative(negative),
    .overflow(overflow)
);
 
initial begin
    a = 0; b = 0; aluc = 0;
    #10;
    //无符号加法
    a = 32'h00000001; b = 32'h00000001; aluc = 4'b0000; //不溢出，结果为32h000000002
    #10;
    a = 32'h11111111; b = 32'h0000000F; aluc = 4'b0000; //溢出，结果为32h000000000
    #10;
    // 无符号减法
    a = 32'h00000002; b = 32'h00000001; aluc = 4'b0001;//不溢出，结果为32'h00000001
    #10;
    a = 32'h00000002; b = 32'h00000011; aluc = 4'b0001;//溢出，结果为FFFFFFF1
    #10;
    //有符号加法
    a = 32'h00000001; b = 32'h00000001; aluc = 4'b0010; //不溢出，结果为32h000000002
    #10;
    a = 32'h01111111; b = 32'h0000000F; aluc = 4'b0010; //溢出，结果为32h1000000
    #10;
    a = 32'h11111111; b = 32'h1000000F; aluc = 4'b0010; //溢出
    #10;
    //有符号减法
    a = 32'h00000002; b = 32'h00000001; aluc = 4'b0011; //不溢出
    #10;
    a = 32'h80000000; b = 32'h0000000F; aluc = 4'b0011; //溢出
    #10;
   //与0100
    a = 32'h80000000; b = 32'h00000001; aluc = 4'b0100;
     #10;
   //或0101
    a = 32'h80000000; b = 32'h00000001; aluc = 4'b0101;
     #10;
   //异或0110
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b0110;
    #10;
   //或非0111
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b0111;
   #10;
   //置高位立即数1001/1000
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b1000;
   #10;
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b1001;
   #10;
   //有符号数比较1011
   a = 32'h00000001; b = 32'hffffffff; aluc = 4'b1011;
   #10;
   a = 32'hffffffff; b = 32'h0000ffff; aluc = 4'b1011;
   #10;
   //无符号数比较1010
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b1010;
   #10;
   //算术右移1100
   a = 32'h00000008; b = 32'hffffffff; aluc = 4'b1100;
   #10;
   a = 32'h00000010; b = 32'h80000000; aluc = 4'b1100;
   #10;
   //逻辑左移/算术左移1111/1110
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b1111;
   #10;
   a = 32'h00000020; b = 32'h00100001; aluc = 4'b1110;
   #10;
   //逻辑右移1101
   a = 32'h80000000; b = 32'h00000001; aluc = 4'b1101;
   #10;
   a = 32'h00000020; b = 32'h00100001; aluc = 4'b1101;
   #10; 
    
end
 
endmodule
